"use client";

import { ReactNode, createContext, useEffect, useState } from "react";

export const PrimaryContext = createContext({
  quiz: [] as Quiz[],
  setQuiz: (quiz: Quiz[]) => {},
});

interface MainContextProps {
  children: ReactNode;
}

export default function MainContext({ children }: MainContextProps) {
  const [quiz, setQuiz] = useState<Quiz[]>([
    {
      id: 1,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ... სუპერგმირები არ არსებობენ... ",
      answer: true,
      myAnswer: undefined,
    },
    {
      id: 2,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 3,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 4,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: true,
      myAnswer: undefined,
    },
    {
      id: 5,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 6,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "",
      answer: true,
      myAnswer: undefined,
    },
    {
      id: 7,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 8,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 9,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "",
      answer: true,
      myAnswer: undefined,
    },
    {
      id: 10,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: false,
      myAnswer: undefined,
    },
    {
      id: 11,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "",
      answer: true,
      myAnswer: undefined,
    },
    {
      id: 12,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ? მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: true,
      myAnswer: undefined,
    },
  ]);

  useEffect(() => {
    if (typeof window !== undefined) {
      const localQuiz = localStorage.getItem("quiz");
      localQuiz !== null && setQuiz(JSON.parse(localQuiz));
    }
  }, []);

  return (
    <PrimaryContext.Provider
      value={{
        quiz,
        setQuiz,
      }}
    >
      {children}
    </PrimaryContext.Provider>
  );
}
