"use client";

import { ReactNode, createContext, useEffect, useState } from "react";

export const PrimaryContext = createContext({
  quiz: [] as Quiz[],
  setQuiz: (quiz: Quiz[]) => {},
});

interface MainContextProps {
  children: ReactNode;
}

export default function MainContext({ children }: MainContextProps) {
  const [quiz, setQuiz] = useState<Quiz[]>([
    {
      id: 1,
      question:
        "თბილისში მეცნიერებმა დაბერების საწინააღმდეგო წამალი აღმოაჩინეს - იხილეთ მალე აფთიაქებში!",
      seeMore:
        "ქართველმა მეცნიერებმა შექმნეს წამალი, რომელიც დაბერების პროცესს ხელს უშლის. კვლევების თანახმად, ეს ინოვაციური პროდუქტი არა მხოლოდ კანის დაბერებას აჩერებს, არამედ ჯანმრთელობის ზოგად მდგომარეობას აუმჯობესებს. გავრცელებული ინფორმაციით, ეს წამალი აფთიაქებში სულ მალე გაიყიდება და მისი მიღება ყველას შეეძლება.",
      hint: "ზოგიერთი გამოცემა მომხმარებლის ყურადღების მიქცევას სენსაციური და შეცდომაში შემყვანი სათაურებით ცდილობს. ამიტომ, ყურადღებით დააკვირდი, თუ რას ეყრდნობა გავრცელებული ინფორმაცია - სანდო წყაროს თუ მხოლოდ ზოგად ცნობებს, მითითებულია თუ არა მასალაში სანდო კვლევა, ემყარება თუ არა მოცემული ინფორმაცია მეცნიერულ მტკიცებულებებს.",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 2,
      question: "წარუმატებლობის მუზეუმი: წარუმატებელი ინოვაციების სამყარო.",
      seeMore:
        "ბუდაპეშტში წარუმატებლობის მოძრავი მუზეუმის (Museum Of Failure) სამთვიანი გამოფენა დასრულდა. მუზეუმის ვებგვერდის (https://museumoffailure.com) თანახმად, დამთვალიერებლებს 200-ზე მეტი ექსპონატის, მათ შორის, წარუმატებელი ელექტრონული მოწყობილობების, საკვები პროდუქტების, სამეცნიერო ექსპერიმენტების ნახვის საშუალება 2024 წლის 14 ივნისიდან 25 აგვისტომდე ჰქონდათ. შეუმდგარი ინოვაციების მოძრავი გამოფენა პირველად 2017 წელს შვედეთს ესტუმრა და მას შემდეგ მსოფლიოს სხვადასხვა ქალაქში 10-ზე მეტი დროებითი გამოფენა მოაწყო. გამოფენების მიზანია საზოგადოებას აჩვენოს, რომ შეცდომები და წარუმატებლობა ინოვაციისა და პროგრესის ბუნებრივი ნაწილია.",
      hint: "აღნიშნული ინფორმაცია პირველწყაროს, მუზეუმის საიტს ეყრდნობა. ის ასევე პასუხს სცემს ინფორმაციისთვის საბაზისო 5  შეკითხვას: ვინ? რა? სად? როდის? რატომ?",
      answer: true,
      myAnswer: undefined,
      // image: "../images/museum.jpeg",
      image: "",
    },
    {
      id: 3,
      question: "ფეისბუქი შეიძლება, საქართველოში გაითიშოს",
      seeMore:
        "ფეისბუქ-ანგარიში მედეა-დიანა ავრცელებს ინფორმაციას, რომ კომპანია Meta მნიშვნელოვან სიახლეებს გეგმავს, რის გამოც, ფეისბუქი რამდენიმე ქვეყანაში, მათ შორის, საქართველოში, შესაძლოა, ხელმისაწვდომი აღარ იყოს. პოსტი ათასობით ადამიანმა გააზიარა. მომხმარებლები ფეისბუქის შესაძლო გათიშვით უკმაყოფილებას გამოხატავენ.",
      hint: "მხოლოდ ფეისბუქ ანგარიშის მიერ გავრცელებული პოსტი ინფორმაციის გამოსაქვეყნებლად საკმარისი არ არის. ვიდრე გაზეთში გამოქვეყნების გადაწყვეტილებას მიიღებ, ინფორმაცია პირველწყაროსთან, ამ შემთხვევაში, კომპანია Meta-სთან უნდა გადამოწმდეს.",
      answer: false,
      myAnswer: undefined,
      image: "../images/fb.png",
    },
    {
      id: 4,
      question:
        "ხელოვნური ინტელექტის მიერ გენერირებული პორტრეტი 432 500 დოლარად გაიყიდა",
      seeMore:
        "ხელოვნური ინტელექტის მიერ შექმნილი ტილო, სახელად „ედმონდ ბელამის პორტრეტი“ კრისტის აუქციონზე 2018 წლის 25 ოქტომბერს 432 500 დოლარად გაიყიდა. სააუქციონო სახლის ვებგვერდის (https://www.christies.com) თანახმად, პორტრეტი საზოგადოება Obvious-ის წევრებმა შექმნეს. მისი მყიდველის ვინაობა კი საჯაროდ არ გამოქვეყნებულა. აუქციონის ორგანიზატორის, რიჩარდ ლოიდის განცხადებით, ხელოვნური ინტელექტი მომავალში ხელოვნების ნიმუშების შექმნაზე დიდ გავლენას მოახდენს, თუმცა მისი მასშტაბი ჯერჯერობით უცნობია.",
      hint: "აღნიშნული ინფორმაცია პირველწყაროს, კრისტის აუქციონს ეყრდნობა. მასალაში წარმოდგენილია როგორც დოკუმენტური (www.christies.com), ასევე, ადამიანური წყარო (აუქციონის ორგანიზატორი). მასალა აუდიტორიას აწვდის ინფორმაციას თუ რა მოხდა, როდის, სად და ვინ მონაწილეობდა მასში.",
      answer: true,
      myAnswer: undefined,
      image: "../images/art.png",
    },
    {
      id: 5,
      question: "თბილისის მეტროსადგურებში საცურაო აუზები განთავსდა",
      seeMore:
        "თბილისის მერიამ, ზაფხულის გაუსაძლისი სიცხისგან დასაცავად, რამდენიმე მეტროსადგურში აუზების მშენებლობა დაიწყო. როგორც ცნობილია, პირველი ასეთი აუზი მეტროსადგურ “სახელმწიფო უნივერსიტეტში” უკვე მოეწყო და მისი ამსახველი ფოტო სოციალურ ქსელებში გავრცელდა. დანარჩენ სადგურებზე სამუშაოები უახლოეს პერიოდში დაიწყება და მომავალი ზაფხულისთვის დასრულდება.",
      hint: "ვიზუალური მანიპულაციის ერთ-ერთი გავრცელებული ფორმაა მასალაში ისეთი ფოტოს გამოყენება, რომელიც მოვლენის აღწერილობას არ შეესაბამება. აღნიშნულ ფოტოზე სადგურის დასახელება მიუთითებს, რომ ის არა მეტრო “სახელმწიფო უნივერსიტეტს”, არამედ “Arsenal”-ს ასახავს, რომელიც პარიზის მეტროსთვის შექმნილი პროექტია. ამასთან, სოციალურ ქსელებში გავრცელებული ინფორმაცია ოფიციალურ წყაროსთან, ამ შემთხვევაში, თბილისის მერიასთან გადამოწმებული არ არის..",
      answer: false,
      myAnswer: undefined,
      image: "../images/metro.jpg",
    },
    {
      id: 6,
      question: "საქართველოში სწრაფი კვების ობიექტები იკრძალება",
      seeMore:
        "გავრცელებული ინფორმაციით, ჯანდაცვის სამინისტრო სწრაფი კვების ობიექტების აკრძალვას გეგმავს. აკრძალვის მიზანი ჯანსაღი კვების პოპულარიზაციაა, რაც მართლაც მისასალმებელია, რადგან სწრაფი კვება მავნებელია და მისი შეზღუდვით ადამიანების ჯანმრთელობა გაუმჯობესდება.",
      hint: "ახალი ამბავი სულ მცირე ორ დამოუკიდებელ წყაროს უნდა ეყრდნობოდეს. ამ შემთხვევაში, მასალაში ერთი წყაროც არ არის წარმოდგენილი. ისეთი ფრაზები, როგორიცაა “გავრცელებული ინფორმაციით”, “საყოველთაოდ ცნობილია”, “ამბობენ, რომ” წყაროდ ვერ ჩაითვლება. ამასთანავე მასალაში არ არის წარმოდგენილი კვლევა, რომელიც ადასტურებს, რომ სწრაფი კვების ობიექტებში წარმოებული საკვები ჯანმრთელობისთვის მავნებელია.",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 7,
      question: "კენტუკის შტატში, მოსახლეობამ მერად კვლავ ძაღლი აირჩია.",
      seeMore:
        "ფრანგულმა ბულდოგმა, სახელად უილბურ ბესტმა, კენტუკის შტატში 2020 წლის 4 ნოემბერს არჩევნებში კატა და ქათამი დაამარცხა და გამარჯვება მოიპოვა. ამის შესახებ Washington Post ადგილობრივ ორგანიზაცია “რებიტ ჰაშის ისტორიულ საზოგადოებაზე” (Rabbit Hash Historical Society) დაყრდნობით წერს. კენტუკის შტატში შემავალ დასახლება რებიტ ჰაშში, სადაც დაახლოებით 500 ადამიანი ცხოვრობს, ცხოველების მერად არჩევას სიმბოლური დატვირთვა აქვს და რა თქმა უნდა, ცხოველები რეალური პოლიტიკურ ძალაუფლებას არ ფლობენ.",
      hint: "უცხოური ამბების შემთხვევაში, საყურადღებოა როგორც  მედიასაშუალება, საიდანაც ამბავი არის ნათარგმნი, ასევე, წყაროები, რომლებსაც თავად ეს მედია ეყრდნობა. Washington Post ავტორიტეტული გამოცემაა, ხოლო “რებიტ ჰაშის ისტორიული საზოგადოება” -  არჩევნების ორგანიზატორი და შესაბამისად, პირველწყაროა. ",
      answer: true,
      myAnswer: undefined,
      image: "../images/dog.png",
    },
    {
      id: 8,
      question:
        "გვალვის მიუხედავად, Nestlé კალიფორნიაში წყლის ჩამოსხმას აგრძელებს.",
      seeMore:
        "საკვები პროდუქტების ერთ-ერთმა უმსხვილესმა კომპანია Nestlé-მ გასულ წელს ბოთლებში ჩამოასხა 36 გალონი წყალი, რომელიც გვალვით დაზარალებული კალიფორნიის ტყიდან ამოიღო. Clearview-ის თანახმად, მიუხედავად იმისა, რომ წყლის მოპოვების ნებართვას ვადა Nestlé-ს 1988 წელს ამოეწურა, წელიწადში $524-ის გადახდით, ის ლიცენზიის შენარჩუნებას კვლავ ახერხებს. გარემოს დაცვითი ერთ-ერთი ჯგუფი, სახელად The Story of Stuff, რომელიც კომპანიას წყლის მოპოვების გამო უჩივის, აცხადებს, რომ Nestlé-ს საქმიანობა უკანონოა.",
      hint: "მასალაში არ არის დაცული ბალანსი მხარეებს შორის. ბალანსის დაცვა განსაკუთრებით მნიშვნელოვანია, როდესაც საქმე სადავო თემებს ეხება, რა დროსაც ერთ-ერთი მხარის პოზიციის გამოტოვებით მკითხველი ვერ შეძლებს ამბის სრულყოფილად გაგებას. იმისათვის, რომ ეს ამბავი გაზეთში მოხვდეს, მასალას კომპანიის პოზიციის დამატება აკლია.",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 9,
      question:
        "1-ელი ივნისიდან მიკროავტობუსებით მგზავრთა გადაყვანა აიკრძალება - რა ბედი ელით “მარშუტკების” მძღოლებს?",
      seeMore:
        "2025 წლის ზაფხულიდან ძალაში შედის კანონი, რომლის თანახმადაც, თუ ქალაქებს შორის დაშორება 150 კმ-ზე მეტია,  მიკროავტობუსებით მგზავრთა გადაყვანა აიკრძალება. მძღოლები შიშობენ, რომ სიახლის ამოქმედების შემდეგ, შესაძლოა, უმუშევრად დარჩნენ. დავით გორელი, რომელიც 10 წელია მიკროავტობუსის მძღოლია, აცხადებს, რომ ის ერთადერთი დასაქმებულია ოჯახში და ამ ცვლილებების გამო, არ იცის, ხვალ პურის ფული სად იშოვოს. სახმელეთო ტრანსპორტის სააგენტოს განცხადებით, მიკროავტობუსის მძღოლებს შესაძლებლობა ექნებათ ავტობუსის მძღოლებად დასაქმდნენ. არასამთავრობო ორგანიზაცია „საქართველოს ტრანსპორტის“  ხელმძღვანელი დავით გზარაული ამბობს, ახალი რეგულაცია საგზაო უსაფრთხოებას გააუმჯობესებს, თუმცა ხელისუფლებამ პარალელურად მძღოლების დასაქმების გეგმაც უნდა წარმოადგინოს, რათა სოციალური პრობლემები გამოირიცხოს. საქალაქთაშორისო მიკროავტობუსებზე დღეის მონაცემებით 100-მდე მძღოლია დასაქმებული.",
      hint: "ინფორმაცია ეყრდნობა როგორც ოფიციალურ წყაროს,  ასევე მძღოლების და ექსპერტის შეფასებას სიახლესთან დაკავშირებით. ზოგჯერ ამბავს 2-ზე მეტი მხარე ჰყავს და ჟურნალისტმა ბალანსის მისაღწევად არა მხოლოდ ოფიციალური წყარო, არამედ იმათი პოზიციაც უნდა წარმოადგინოს, ვისაც უშუალოდ შეეხება ცვლილებები, ასევე ნეიტრალური ექსპერტული შეფასებები.",
      answer: true,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 10,
      question:
        "საფრანგეთი და გერმანია ევროკავშირის დაშლის ინიციატივით გამოვიდნენ!",
      seeMore:
        "პოლონური ტელევიზია TVP-ს და „პოლონური რადიოს” თანახმად, 23 ივნისს ბერლინში გამართულ მინისტერიალზე გერმანიისა და საფრანგეთის საგარეო საქმეთა მინისტრებმა 9-გვერდიანი დოკუმენტი, სახელწოდებით „ძლიერი ევროპა გაურკვეველ მსოფლიოში” წარადგინეს. დოკუმენტი უსაფრთხოების, მიგრაციის და ეკონომიკის მიმართულებით თანამშრომლობის გაძლიერებას ითვალისწინებს. მინისტრები მიიჩნევენ, რომ ერთიან და ძლიერ ევროპას შეუძლია უკეთესად გაუმკლავდეს თანამედროვე გლობალურ გამოწვევებს.",
      hint: "მასალის სათაური ტექსტს არ შეესაბამება. ინფორმაცია უცხოურ მედია წყაროს ეყრდნობა, ხოლოსტატიაში მოყვანილი დოკუმენტი არა ევროკავშირის დაშლის ინიციატივას, არამედ, ევროინტეგრაციის ახალ ხედვას შეეხება. შესაბამისად, სატყუარა  (ქლიქბაითი) სათაური წინააღმდეგობაშია თავად ტექსტთან. იმისთვის, რომ მასალა გამოქვეყნდეს, სათაური უნდა შეიცვალოს, ინფორმაციას კი დაემატოს დამატებითი დეტალები კონტექსტის გასაგებად.",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 11,
      question: `მოგზაურობა ევროპაში მხოლოდ "რედ ბულის" ქილების მეშვეობით.`,
      seeMore:
        "კომპანია “რედ ბული” ყოველწლიურად ატარებს კონკურსს, რომელშიც მონაწილეები ქილებს ვალუტის ფუნქციით იყენებენ და ევროპის მასშტაბით მოგზაურობენ. კომპანიის ვებგვერდის (https://www.redbull.com) თანახმად, 2024 წელს კონკურსი 21-28 მაისს გაიმართა. კონკურსმა სტარტი 5 ევროპული ქალაქიდან აიღო. მათი დანიშნულების ადგილი ბერლინი იყო. კონკურსანტებმა ჯამში 600 000 კმ დაფარეს და ამისთვის სულ 44 000+ ქილა გამოიყენეს. კონკურსი განკუთვნილია ალტერნატიული ან სახალისო სამოგზაურო გამოწვევების მოყვარული ადამიანებისთვის.",
      hint: "ამბავი ეყრდნობა კომპანიის ვებგვერდს, ამბის პირველწყაროს. სათაური ტექსტს შეესაბამება.",
      answer: true,
      myAnswer: undefined,
      image: "../images/redbull.png",
    },
    {
      id: 12,
      question: "ვისი კოსტიუმით აღნიშნა ჰელოუინი მარკ ცუკერბერგმა?",
      seeMore:
        "კომპანია “მეტას” აღმასრულებელმა დირექტორმა, მარკ ცუკერბერგმა 2024 წლის ჰელოუინი მხიარულად აღნიშნა და ფოტოები Facebook-ის პირად გვერდზე გამოაქვეყნა. მიუხედავად იმისა, რომ ბევრმა ის ჰარი პოტერის“ პერსონაჟს, სევერუს სნეიპს შეადარა, თავად წერს, რომ მისი შთაგონების წყარო ჯონ უიკია.",

      hint: "ინფორმაცია პირველწყაროს, Meta-ს აღმასრულებელი დირექტორის მარკ ცუკერბერგის ოფიციალურ, ვერიფიცირებულ ანგარიშს ეყრდნობა და სტატიაში ანგარიშის ბმულიც არის მითითებული. ფეისბუქ-ანგარიშის სახელთან ლურჯი სიმბოლო “✔️” მიუთითებს, რომ ეს ანგარიში ვერიფიცირებულია.",
      answer: true,
      myAnswer: undefined,
      image: "../images/mark.jpg",
    },
    {
      id: 13,
      question: "პარიზში ფერმერები საპროტესტო აქციას მართავენ!",
      seeMore:
        "მესამე დღეა ფრანგი ფერმერები პარიზში, ეიფელის კოშკთან საპროტესტო აქციას მართავენ. მათ მნიშვნელოვანი მაგისტრალები ტრაქტორებით გადაკეტეს. ისინი, ინფლაციის გამო, შემოსავლების კლებას, სუბსიდირების შესაძლო გაუქმებას და გაზრდილ ბიუროკრატიას აპროტესტებენ. საფრანგეთის შსს-ს მინისტრმა ჟერალდ დარმანენმა ფერმერებს მოუწოდა, „წითელი ხაზები“ არ გადაკვეთონ და აეროპორტები არ დაბლოკონ.",
      hint: "მიუხედავად იმისა, რომ მასალაში მოყვანილი ფაქტები ნამდვილია, ფოტო, რომელიც ახალ ამბავს ახლავს, რეალობას არ ასახავს. ფოტო არტისტმა ifonly.ai-მ ხელოვნური ინტელექტის გამოყენებით შექმნა, რაც მის ინსტაგრამ პოსტშიც არის მითითებული. მასალის ამ ფორმით გამოქვეყნების შემთხვევაში, ადამიანები დაიჯერებენ, რომ ეს ფოტო დოკუმენტური მტკიცებულებაა. უმჯობესია, მასალაში რეალური ფოტო იყოს გამოყენებული, იმ შემთხვევაში კი, თუ ჟურნალისტი ხელოვნური ინტელექტით გენერირებულ ფოტოს იყენებს, ამის შესახებ მასალაში მკაფიოდ უნდა იყოს აღნიშნული.",
      answer: false,
      myAnswer: undefined,
      image: "../images/paris.png",
    },
    {
      id: 14,
      question: "Burger King-ს მომხმარებლები ბურგერის ზომის გამო ედავება",
      seeMore:
        "აშშ-ში სწრაფი კვების ქსელ Burger King-ს მომხმარებლები ბურგერ “ვოპერის” ზომის გამო ედავებიან. მოსარჩელეებმა: უოლტერ კოულმენმა, მარკო დილეონარდომ, მეთიუ ფოქსმა და მადლინ ზალცმანმა კომპანიის წინააღმდეგ სარჩელი ფლორიდის სასამართლოში 2022 წლის 28 მარტს შეიტანეს. სარჩელის თანახმად, მოსარჩელეები ამტკიცებენ, რომ რეალური პროდუქტი, ბანერზე წარმოდგენილ ბურგერთან შედარებით, 35%-ით პატარაა და ნაკლებ შიგთავსს შეიცავს. Burger King-ის განცხადებით, დავა უსაფუძვლოა, რადგან კომპანიას “სარეკლამო მოდელის“ ზუსტი ანალოგის გაყიდვა არ მოეთხოვება. სასამართლომ გადაწყვეტილების მიღება ნაფიც მსაჯულებს ანდო.",
      hint: "მასალა ეყრდნობა ოფიციალურ წყაროს, სასამართლოში შეტანილ სარჩელს. ამბიდან მკითხველი მოდავე მხარეების პოზიციას იგებს. სათაური ტექსტს შეესაბამება",
      answer: true,
      myAnswer: undefined,
      image: "",
    },
  ]);

  useEffect(() => {
    if (typeof window !== undefined) {
      const localQuiz = localStorage.getItem("quiz");
      localQuiz !== null && setQuiz(JSON.parse(localQuiz));
    }
  }, []);

  return (
    <PrimaryContext.Provider
      value={{
        quiz,
        setQuiz,
      }}
    >
      {children}
    </PrimaryContext.Provider>
  );
}
