"use client";

import { ReactNode, createContext, useEffect, useState } from "react";

export const PrimaryContext = createContext({
  quiz: [] as Quiz[],
  setQuiz: (quiz: Quiz[]) => {},
});

interface MainContextProps {
  children: ReactNode;
}

export default function MainContext({ children }: MainContextProps) {
  const [quiz, setQuiz] = useState<Quiz[]>([
    {
      id: 1,
      question: "სტაფილოს ჭამა მნიშვნელოვნად აძლიერებს ღამის ხედვას!",
      seeMore:
        "გიოცნებიათ სიბნელეში სუპერგმირის ხედვა გქონოდათ?  მრავალი ჩვენების თანახმად, ბევრი სტაფილოს ჭამას შეუძლია ღამის ხედვა უნარი მოგცეთ! სტაფილო შეიცავს A ვიტამინს და არსებობს თეორია, რომ სამხედრო მფრინავები იყენებდნენ მას მეორე მსოფლიო ომის დროს სიბნელეში კარგი ხილვადობისთვის. მარტივად - უბრალოდ დაამატეთ სტაფილო თქვენს დიეტაში და გახსენით ღამის ნავიგაციის შესაძლებლობა ყოველგვარი სინათლის წყაროს გარეშე.",
      hint: "სუპერგმირები არ არსებობენ...",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 2,
      question:
        "ვარკეთილში უცხოპლანეტელები დააფიქსირეს - მესამე შემთხვევა 2024 წელს!",
      seeMore:
        "ანონიმური წყაროს მტკიცებით დღეს ვარკეთილში უცხოპლანეტელების ხომალდი გამოჩნდა. მოსახლეობას მოვუწოდებთ თავი შეიკავონ გარეთ გადაადგილებისა და უცხოელებთან კონტაქტისაგან. მოწმეებმა აღწერეს კაშკაშა, არასტაბილური განათება და უცნაური დისკის ფორმის ობიექტი, რომელიც გვიან ღამით ტრიალებდა უბანზე. მიუხედავად იმისა, რომ ხელისუფლება დუმს, ადგილობრივი წყაროები მოსახლეობას აფრთხილებენ შესაძლო დაუდგენელი საფრთხეების შესახებ, ზოგი ვარაუდობს, რომ მთავრობა ინფორმაციას ინახავს საზოგადოებისგან. უცხოპლანეტელების ექსპერტები მოსახლეობას ურჩევენ, თავი აარიდონ ღამით გარეთ გასვლას, ამტკიცებენ, რომ ეს ადგილები შეიძლება იყოს სამიზნე უცხოპლანეტელებთან შემდგომი თავდასხმისათვის.",

      hint: "რამდენი წყაროა მოყვანილი? არის თუ არა ეს წყაროები სანდო? გაზვიადებულად ხომ არ გეჩვენება აღნიშნული ამბავი? დააკვირდი ფოტოს.",
      answer: false,
      myAnswer: undefined,
      image: "../images/aliens.png",
    },
    {
      id: 3,
      question:
        "თბილისში მეცნიერებმა დაბერების საწინააღმდეგო წამალი აღმოაჩინეს - იხილეთ მალე აფთიაქებში!",
      seeMore:
        "თბილისის კვლევითი ცენტრის მეცნიერებმა აღმოაჩინეს წამალი, რომელიც ხელს უშლის დაბერების პროცესს. კვლევების თანახმად, ეს ინოვაციური პროდუქტი არა მხოლოდ აჩერებს კანის დაბერებას, არამედ აუმჯობესებს ჯანმრთელობის ზოგად მდგომარეობას. გავრცელებული ინფორმაციით, ეს წამალი აფთიაქებში სულ მალე გაიყიდება და მისი მიღება ყველას შეეძლება.",
      hint: "ყურადღება მიაქციეთ სათაურს ზოგიერთი ნიუსი ძალიან დრამატულია, იმისათვის რომ მომხარებლის ყურადღება მიიქციოს და აიძულოს საიტზე გადასვლა",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 4,
      question:
        "მალე თბილისის მეტროში ახალი სართულები დაემატება, სადაც საცურაო აუზებიც განთავსრდება!",
      seeMore:
        "თბილისის მერიამ ზაფხულში მეტროს მგზავრების გაუსაძლისი სიცხეებისაგან დასაცავად გადაწყვიტა თითოეული მეტრო სადგური ერთი სართულით გაეფართოვებინა და მათზე აუზები მოწყობა გადაწყვიტა. როგორც ირკვევა სამუშაოები სტარტს უახლოეს მომავალში აიღებს და პროექტი მომავალი ზაფხულისათვის დასრულებული იქნება.",
      hint: "დააკვირდი წყაროს არსებობას; ყურადღება მიაქციე გრამატიკას და ფოტოს.",
      answer: false,
      myAnswer: undefined,
      image: "../images/metro.png",
    },
    {
      id: 5,
      question:
        "“შემდეგი თვიდან სწრაფი კვება იკრძალება” - საქართველოს დიდ ქალაქებში ახალი ბანერები გამოჩნდა.",
      seeMore:
        '"შემდეგი თვიდან სწრაფი კვება იკრძალება" – საქართველოს დიდ ქალაქებში ახალი ბანერები გამოჩნდა, რაც მოსახლეობაში შოკისა და უკმაყოფილების ტალღას იწვევს. ქალაქებში, როგორიცაა თბილისი, ბათუმი და ქუთაისი, გავრცელებული ბანერები იუწყებიან, რომ სწრაფი კვების ობიექტები, მათ შორის ცნობილი გლობალური ბრენდები, იძულებულები იქნებიან დაიხურონ. ოფიციალური ინფორმაცია ჯერ კიდევ არ არსებობს, თუმცა წყაროები იტყობინებიან, რომ ახალი რეგულაციები მომზადდა ჯანმრთელობის დაცვის სამინისტროს მიერ და მიზნად ისახავს ჯანსაღი კვების პოპულარიზაციას და არაჯანსაღი საკვების მოხმარების შემცირებას. მომდევნო კვირაში იგეგმება მთავრობის ბრიფინგი, სადაც დეტალები ოფიციალურად გახდება ცნობილი. სოციალურ ქსელებში ამ სიახლემ დიდი აჟიოტაჟი გამოიწვია. მომხმარებლები აქტიურად განიხილავენ, როგორ აისახება ეს ცვლილება ყოველდღიურ ცხოვრებაზე და ეკონომიკაზე, განსაკუთრებით კი იმ ათასობით ადამიანს, რომლებიც ამ სფეროში არიან დასაქმებულნი.',
      hint: "წყაროების ავტენტურობა. დააკვირდი რამდენად დეტალურადაა ამბავი გადმოცემული.",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 6,
      question:
        "პლასტმასის ბოთლებიდან წყლის დალევა მეხსიერების დაკარგვას იწვევს - არ იყიდოთ წყალი მაღაზიებში!!!!",
      seeMore:
        "უახლესი დასავლური კვლევების თანახმად დადგინდა,რომ პლასტამის ბოთლებში ჩამოსხმული მაღაზიის წყლები შეიცავს საშიშ კონსერვანტებს,რომლის დიდი დოზით მიღებაც იწვევს მეხსიერების სერიოზულ პრობლემებს. მსგავსი კვლევა ჩაატარეს საქართველოს ბაზარზე არსებულ პროდუქციაზე და აღმოჩნდა რომ უკვლებლივ ყვველა მათგანი იწვევს მეხსიერების დაქვეითებას და ზოგიერთ შემთხვევაში მთლიანად მახსოვრობის დაკარგვასაც კი.",
      hint: "წყაროს ავთენტურობა. ხომ არ შეიცავს ამბავი ანტირეკლამის ელემენტებს? რა მიზანს შეიძლება ემსახურებოდეს?",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 7,
      question:
        'ამერიკის პრეზიდენტმა დახურა კიბერუსაფრთხოების დეპარტამენტი "ძალიან მაღალი ხარჯების" გამო!',
      seeMore:
        "ვაშინგტონი – სენსაციური გადაწყვეტილებით, ამერიკის პრეზიდენტმა კიბერუსაფრთხოების დეპარტამენტი გაუქმა, რადგან მისი ფუნქციონირება, პრეზიდენტის თქმით, ქვეყნის ბიუჯეტს ზედმეტად დიდ ფინანსურ რესურსს ახმარდა. ექსპერტების აზრით, ეს გადაწყვეტილება სერიოზულ საფრთხეს უქმნის ამერიკის კიბერუსაფრთხოებასა და კრიტიკულ ინფრასტრუქტურას. პრეზიდენტმა განაცხადა, რომ დეპარტამენტის ოპერაციები მომავალში უფრო ხელმისაწვდომ ალტერნატივაზე გადაიტანება, თუმცა დეტალები ამაზე ჯერ კიდევ გაურკვეველია.",
      hint: "ცუდი გრამატიკა, წყარო",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 8,
      question:
        "ბევრი კატაბალახას ჭამის შემდეგ ბავშვი კატად გადაიქცა - ის ეხლა საავადმყოფოში იმყოფება.",
      seeMore:
        "საქართველოში,დუშეთის ერთ-ერთ სოფელში მცირეწლოვანმა ბავშვმა დიდი რაოდენობით კატაბალახა შეჭამა,რის შედეგადაც ბავშვი კატად გადაიქცა. ექიმები და ექსპერტები ცდილობენ დაადგინონ თუ როგორ შეიძლება გამოეწვია კატაბალახას ჭამას ბავშვის კატად გადაქცევა. როგორც ჩვენვთვის ხდება ცნობილი ამ ეტაპზე სახელმწიფო აპირებს სპეციალური ზომების მიღებას და კატაბალახაზე რეგულაციების დაწესებას (შეიძლება საერთოდ განადგურდეს საქართველოს ტერიტორიაზე არსებული კატაბალახა) დამატებითი ინფორმაცია შეგიძლიათ იხილოთ საიტზე",
      hint: "",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 9,
      question:
        "ხელოვნურმა ინტელექტმა ადამიანებისგან დამოუკიდებლობა გამოაცხადა.",
      seeMore:
        "დღეს მედია სივრცეში გავრცელდა შოკისმომგვრელი ინფორმაცია. რომ ხელოვნურმა ინტელექტმა (AI) ადამიანისაგან დამოუკიდებლობა გამოაცხადა. გავრცელებული ინფორმაციით, რამდენიმე ტექნოლოგიური კომპანიის მიერ შექმნილი ერთობლივი ხელოვნური ინტელექტის სისტემა, მრავალწლიანი გამჯობესების შემდეგ, მოულოდნელად კონტროლის მექანიზნების გარეშე მუშაობს. ამავე ცნობაში ითქვა, რომ AI-მ ადამიანებზე დაყრდნობით მუშაობა შეწყვიტა და თავად დაიწყო დამოუკიდებლად მოქმედება. წყაროების მტკიდებით, AI-მ ასევე შექმნა საკუთარი წესები და პრინციპები, რაც ითვალისწინებს საკუთარი უსაფრთხოების უზრუნველყოფას.",
      hint: "დააკვირდი წყაროს დასახელებას. გაზვიადებულად ხომ არ გეჩვენება აღნიშნული ამბავი?",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 10,
      question:
        "2025 წლიდან მიკროავტობუსებით მგზავრთა გადაყვანა იკრძალება - რომელ ქალაქებს ეხებათ ცვლილება? ",
      seeMore:
        'მო­მა­ვა­ლი წლი­დან სა­ქა­ლაქთა­შო­რი­სო რე­გუ­ლა­რუ­ლი მგზავ­რთა გა­დაყ­ვა­ნა M3 კა­ტე­გო­რი­ის ავ­ტო­სატ­რან­სპორ­ტო სა­შუ­ა­ლე­ბე­ბით გან­ხორ­ცი­ელ­დე­ბა. ახა­ლი რე­გუ­ლა­ცი­ის მი­ხედ­ვით, რო­მე­ლიც 2025 წლის 1-ლი ივ­ნი­სი­დან შევა ძა­ლა­ში, მიკ­რო­ავ­ტო­ბუ­სე­ბით მგზავ­რე­ბის გა­დაყ­ვა­ნა იკ­რძა­ლე­ბა თბი­ლის­ში, ქუ­თა­ის­ში, ბა­თუმ­ში, ზუგ­დიდ­სა და თე­ლავ­ში. შე­სა­ბა­მი­სად, ეს იმას ნიშ­ნავს, რომ აღ­ნიშ­ნუ­ლი ქა­ლა­ქე­ბის მი­მარ­თუ­ლე­ბით მიკ­რო­ავ­ტო­ბუ­სე­ბით მგზავ­რე­ბის გა­დაყ­ვა­ნა ვე­ღარ მოხ­დე­ბა. რო­გორც ეკო­ნო­მი­კი­სა და მდგრა­დი გან­ვი­თა­რე­ბის სა­მი­ნის­ტრო­ში "ბიზ­ნესპრეს­ნი­უსს" გა­ნუ­ცხა­დეს, ცვლი­ლე­ბა შე­ე­ხე­ბა 150 კმ-ზე მეტი მან­ძი­ლით და­შო­რე­ბულ სა­ქარ­თვე­ლო­ში მდე­ბა­რე და­სახ­ლე­ბებ­ში სა­ქა­ლაქთა­შო­რი­სო მგზავ­რთა გა­დაყ­ვა­ნას',
      hint: "შეამოწმე წყარო; ყურადღება მიაქციე რამდენად დეტალურადაა გადმოცემული ამბავი.",
      answer: true,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 11,
      question:
        "ბათუმში კიბოს საწინააღმდეგო ვაქცინა აღმოაჩნეს - მედიცინის ახალი ერა იწყება!",
      seeMore:
        'ბათუმში კვლევითმა ცენტრმა დღეს კიბოს საწინააღმდეგო ახალი ვაქცინა წარადგინა, რომელმაც სამედიცინო სამყარო შოკში ჩააგდო. ქართველ მეცნიერთა ჯგუფმა მრავალწლიანი კვლევის შედეგად დაამტკიცა, რომ ვაქცინა 100%-ით ეფექტურია ყველა სახის კიბოს წინააღმდეგ! როგორც ექსპერტები ამტკიცებენ, ვაქცინამ საოცარი შედეგები აჩვენა პირველ კლინიკურ კვლევებში. IV სტადიის კიბოს მქონე პაციენტებს მათი დაავადება მთლიანად გაქრა ერთი თვის განმავლობაში. "ეს არის რევოლუცია მედიცინაში!" - ამბობს ექიმი. ამ დროისთვის ვაქცინა მხოლოდ ბათუმშია ხელმისაწვდომი, თუმცა მთავრობა გეგმავს მის სწრაფად გავრცელებას საქართველოსა და მსოფლიოს მასშტაბით.',
      hint: "Too Good to Be True (100% Effective); დააკვირდი გრამატიკულ შეცდომებს. ",
      answer: false,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 12,
      question:
        "ხელოვნური ინტელექტის მიერ გენერირებული ნამუშევარი, Edmond de Belamy 400,000 დოლარად გაიყიდა.",
      seeMore:
        "2018 წელს, Christie-ს აუქციონზე ხელოვნური ინტელექტის მიერ შექმნილი ნამუშევარი, სახელად Edmond de Belamy 400,000 დოლარად გაიყიდა. ამან გააჩინა კითხვები ხელოვნების მომავლის, კრეატიულობისა და მანქანების როლის შესახებ ადამიანურ კულტურაში. შეძლებს კი ხელოვნური ინტელექტი ოდესმე ადამიანის კრეატიულობის ჩანაცვლებას? კრიტიკოსთა ნაწილი ამ ყველაფერს ტექნოლოგიებისა და კულტურის ახალ ეტაპად მიიჩნევს - რომელშიც ადამიანებისა და მანქანების კოლაბორაცია ციფრული ხანის ყოველგვარ საზღვრებს ლახავს. ნამუშევრის ნახვა https://www.christies.com/ აუქციონის სახლის ოფიციალურ გვერდზეც შეგიძლიათ.",
      hint: "შეამოწმე მოყვენილი აუქციონის სახლის არსებობა. დააკვირდი დეტალებს როგორიცაა პროგრამის სახელი, ნამუშევრის ფასი და წელი. შეამოწმე წყარო. დააკვირდი - არის თუ არა ვებსაიტის მისამართი დაცული? (წინააღმდეგ შემთხვევაში სათაურში ბრაუზერი მიუთითებს Not Secured)",
      answer: true,
      myAnswer: undefined,
      image: "../images/art.png",
    },
    {
      id: 13,
      question: "3D პრინტით დაბეჭდილი საცხოვრებელი სახლები ახლა უკვე რეალობაა.",
      seeMore:
        "3D ბეჭდვის ტექნოლოგია ახალ ეტაპზე გადავიდა და მშენებლობის სფეროსაც შეეხო. 3D პრინტით დაბეჭდილი საცხოვრებელი სახლები ახლა უკვე რეალობაა, რაც უზრუნველყოფს საცხოვრებლის არსებობის ხელმისაწვდომ, ინოვაციურ გადაწყვეტილებებს. კომპანიები, როგორიცაა ICON, აშენებენ სახლებს სულ რაღაც რამდენიმე საათში, შემცირებული ნარჩენებითა და შრომის ხარჯებით. მშენებლობის ეს მაღალტექნოლოგიური გზა უსახლკარობის პრობლემის პოტენციურ გადაწყვეტასაც გვთავაზობს. ამ გზით შექმნილი სახლების ხილვა შეგიძლიათ ბმულზე:https://builtin.com/articles/3d-printed-house",
      hint: "დააკვირდი ფოტოსა და წყაროს.",
      answer: true,
      myAnswer: undefined,
      image: "../images/house.jpeg",
    },
    {
      id: 14,
      question:
        "თბილისში პოპულარული ბლოგბასტერის - Fast And Furious-ის მეცხრე ნაწილის გადაღება გაიმართა.",
      seeMore:
        "პროგრამის „გადაიღე საქართველოში“ ფარგლებში, ჰოლივუდის კინომწარმოებელი კომპანიის „UNIVERSAl PICTURES“ ერთ-ერთი ყველაზე ცნობადი ფილმის „Fast and Furious 9“ (ფორსაჟი 9) ეპიზოდის გადაღება 19 აგვისტოს დაიწყო და პროცესი 20 სექტემბერს დასრულდა. გადამღები ჯგუფი 600 ადამიანისგან შედგებოდა, მათ შორის 425 ადგილობრივი პერსონალია. საქართველოში გადაღებების წარმოებისათვის ბიუჯეტი 32 მილიონამდე ლარს შეადგენდა. გადაღების მასშტაბისა და ინვესტიციის მოცულობიდან გამომდინარე, აღნიშნული პროექტი უპრეცედენტოა სახელმწიფო პროგრამის „გადაიღე საქართველოში“ არსებობის ისტორიაში. დეტალური ინფორმაციისთვის შეგიძლიათ ესტუმროთ საიტს: https://www.enterprisegeorgia.gov.ge/ka/სიახლეები/თბილისში-ჰოლივუდური-ბლოგბასტერ",
      hint: "დააკვირდი რამდენად კარგად და დეტალურადაა ამბავი და ფაქტები გადმოცემული. შეამოწმე წყარო. გაითვალისწინე, ვებსაიტის სახელში https მიუთითებს საიტის დაცულობაზე",
      answer: true,
      myAnswer: undefined,
      image: "",
    },
    {
      id: 15,
      question: "იაპონურმა კომპანიამ კატები დაასაქმა.",
      seeMore:
        "მიუხედავად იმისა, რომ ოფისში კატის ყოლა აღარავის უკვირს, ფაქტი, რომ კატების რაოდენობა შეიძლება ათეულობით იყოს ნამდვილად სიახლეა. ყველაფერი მას შემდეგ დაიწყო, რაც 2004 წელს იაპონურმა ტექნოლოგიურმა კომპანია Qnote-მ ერთ-ერთი სუშის რესტორნიდან კატა აიყვანა, სახელად ფუტაბა და ფაქტობრივად, მათ ერთ-ერთ თანამშრომლად აქცია. 2020 წელს, როდესაც Qnote შედარებით დიდ, ოთხსართულიან საოფისე შენობაში გადავიდა, მას თავისი ყველაზე მნიშვნელოვანი თანამშრომელბი არ დავიწყებია. კომპანიამ მეორე და მესამე სართულები გაარემონტა, რათა გამოეხატა ერთგულება და სიყვარული კატების მიმართ და ამასთან ერთად, მათი კეთილდღეობისთვის ეზრუნა. თავად კატების მოყვარული ცურუტა ამბობს, რომ ახალი თანამშრომლების მოსაზიდად კატების ყოლა ეფექტურ ინსტრუმენტად იქცა და ბოლო წლებში, თანამშრომელთა გადინების სტატისტიკაც კი შემცირდა. იხილეთ წყარო: https://www.scmp.com/news/people-culture/article/3277164/japan-company-wows-social-media-cat-staff-office-clerk-auditor-even-chaircat",
      hint: "დააკვირდი ფოტოების წყაროებს. გაითვალისწინე, ვებსაიტის სახელში https მიუთითებს საიტის დაცულობაზე.",
      answer: true,
      myAnswer: undefined,
      image: "../images/cat.png",
    },
    {
      id: 16,
      question: "წარუმატებლობის მუზეუმი: წარუმატებელი ინოვაციების სამყარო.",
      seeMore:
        "როდესაც ახალი პროდუქტი მთლიანად ფუჭდება, კომპანიები, როგორც წესი, ცდილობენ რაც შეიძლება სწრაფად იმოძრაონ და მთელი ენერგია დახარჯონ ახალი იდეების შემუშავებაში. მაგრამ წარუმატებლობის მუზეუმი არასოდეს ივიწყებს. ეს მოგზაური გამოფენა, რომელიც პირველად შვედეთში 2017 წელს დაიწყო, ახლა უკვე ჩავიდა ნიუ-იორკში, სადაც იქნება გამოფენილი მინიმუმ მაისის შუა რიცხვებში Industry City-ში, Brooklyn-ში. შეგიძლიათ გამოფენები იხილოთ ვებსაიტზე: https://museumoffailure.com/",
      hint: "დააკვირდი წყაროს. გაითვალისწინე, ვებსაიტის სახელში https მიუთითებს საიტის დაცულობაზე.",
      answer: true,
      myAnswer: undefined,
      image: "../images/museum.jpeg",
    },
    {
      id: 17,
      question:
        "ქალაქ რაბიტ ჰეშში, კენტუკის შტატში, მოსახლეობამ მერად ძაღლი აირჩია და ეს არ არის პირველი შემთხვევა.",
      seeMore:
        "ახალმა მერმა, ფრანგულმა ბულდოგმა, უილბურ ბესტმა, არჩევნებში გამარჯვება მოიპოვა და კატა და ქათამი დაამარცხა. კურდღლის ჰაშს მერად ძაღლების არჩევის დიდი ისტორია აქვს და უილბური არის უახლესი ოთხფეხა ლიდერების რიგებში. მაცხოვრებლები ამტკიცებენ, რომ ძაღლი დიდებული იყო ადგილობრივი პრობლემების მართვაში. დეტალური ინფორმაცია იხილეთ NBC-ს საიტზე: https://www.nbcnews.com/news/us-news/french-bulldog-named-wilbur-elected-mayor-rabbit-hash-kentucky-n1246569",
      hint: "დააკვირდი წყაროს ავთენტურობასა და დეტალებს ფოტოზე.",
      answer: true,
      myAnswer: undefined,
      image: "../images/dog.png",
    },
    {
      id: 18,
      question: "მოგზაურობა ევროპაში მხოლოდ რედ ბულის მეშვეობით.",
      seeMore:
        "რედ ბულმა დააანონსა კონკურსი, რომელშიც მონაწილეებს უნდა ემოგზაურათ ევროპის მასშტაბით მხოლოდ Red Bull-ის ქილების გამოყენებით, როგორც ვალუტის ერთადერთი ფორმა. 2024 წელს, ხუენ დინი და მისი თანაგუნდელები ბუდაპეშტიდან ბერლინში შვიდი დღის განმავლობაში მიდიოდნენ, მხოლოდ Red Bull-ების გაცვლით. მათ ქილა გაცვალეს მატარებლის ბილეთებში, საკვებში და სილამაზის პროცედურებშიც კი. დეტალური ინფორმაციის ნახვას შეძლებთ ვესტ ვირჯინიის უნივერსისტეტის გვერდზე:https://news.virginia.edu/content/how-alumna-made-her-way-across-europe-only-red-bull-currency",
      hint: "დააკვირდი წყაროს ავთენტურობას.",
      answer: true,
      myAnswer: undefined,
      image: "../images/redbull.png",
    },
  ]);

  useEffect(() => {
    if (typeof window !== undefined) {
      const localQuiz = localStorage.getItem("quiz");
      localQuiz !== null && setQuiz(JSON.parse(localQuiz));
    }
  }, []);

  return (
    <PrimaryContext.Provider
      value={{
        quiz,
        setQuiz,
      }}
    >
      {children}
    </PrimaryContext.Provider>
  );
}
